module.exports = {
    title: '주니어 백엔드 개발자 인터뷰',
    description: 'CS 공부를 위한 저장소',
    base: "/junior-be-interview/",
    dest: 'build',
    themeConfig: {
        logo: 'https://avatars.githubusercontent.com/u/50647845?v=4',
        nav: [
            {text: 'Home', link: '/'}
        ],
        sidebar: [
            {
                title: '📐 자료구조',
                collapsable: true,
                children: [
                    '/02_자료구조/01_시공간복잡도',
                    '/02_자료구조/02_배열',
                    '/02_자료구조/03_연결리스트',
                    '/02_자료구조/04_백터',
                    '/02_자료구조/05_스택',
                    '/02_자료구조/06_큐',
                    '/02_자료구조/07_덱',
                    '/02_자료구조/08_우선순위큐',
                    '/02_자료구조/09_그래프',
                    '/02_자료구조/10_트리',
                    '/02_자료구조/11_힙',
                    '/02_자료구조/12_셋',
                    '/02_자료구조/13_맵',
                    '/02_자료구조/14_해시테이블',
                ]
            },
            {
                title: '🧩 디자인패턴',
                collapsable: true,
                children: [
                    '/01_디자인패턴/01_싱글톤',
                    '/01_디자인패턴/02_팩토리메소드',
                    '/01_디자인패턴/03_추상팩토리',
                    '/01_디자인패턴/04_빌더',
                    '/01_디자인패턴/05_프로토타입',
                    '/01_디자인패턴/06_어댑터',
                    '/01_디자인패턴/07_브릿지',
                    '/01_디자인패턴/08_컴포짓',
                    '/01_디자인패턴/09_데코레이터',
                    '/01_디자인패턴/10_퍼사드',
                    '/01_디자인패턴/11_플라이웨이트',
                    '/01_디자인패턴/12_프록시',
                    '/01_디자인패턴/13_책임연쇄',
                    '/01_디자인패턴/14_커맨드',
                    '/01_디자인패턴/15_인터프리터',
                    '/01_디자인패턴/16_이터레이터',
                    '/01_디자인패턴/17_중재자',
                    '/01_디자인패턴/18_메멘토',
                    '/01_디자인패턴/19_옵저버',
                    '/01_디자인패턴/20_상태',
                    '/01_디자인패턴/21_전략',
                    '/01_디자인패턴/22_템플릿',
                    '/01_디자인패턴/23_방문자',
                ]
            }
        ]
    }
}
